{
  "title": "Coordinate Systems",
  "youtube": "https://www.youtube.com/watch?v=your-coordinate-systems-video",
  "sections": [
    {
      "title": "Introduction (Wide Shot)",
      "content": "Hey everyone, I’m Jihad Al Sayed. In this video, we’re looking at coordinate systems — how we represent vectors using a chosen basis. This is a must-know concept for everything from graphics to machine learning."
    },
    {
      "title": "What is a Coordinate System?",
      "content": "A coordinate system expresses vectors as linear combinations of basis vectors. It gives meaning to positions and directions in space — whether you're in ℝ², ℝ³, or some abstract vector space."
    },
    {
      "title": "Vector Representation in a Basis",
      "math": "If B = \\{v₁, v₂\\} is a basis for \\mathbb{R}^2, then any vector x can be written as x = a₁v₁ + a₂v₂.\n\\Rightarrow Coordinates of x relative to B are [a₁, a₂]."
    },
    {
      "title": "Change of Basis",
      "content": "Switching between coordinate systems requires a change of basis. This is essential in computer graphics, physics simulations, and PCA."
    },
    {
      "title": "Change of Basis Matrix",
      "math": "Let P be a matrix whose columns are the new basis vectors. Then:\n[x]_new = P⁻¹ * x"
    },
    {
      "title": "Graph: Basis Vectors and Vector Projection",
      "graph": [
        {
          "name": "Basis Vectors",
          "series": [
            {
              "name": "v₁",
              "value": 1
            },
            {
              "name": "v₂",
              "value": 2
            }
          ]
        },
        {
          "name": "Vector x",
          "series": [
            {
              "name": "x",
              "value": 3
            }
          ]
        }
      ],
      "xLabel": "Vector",
      "yLabel": "Magnitude"
    },
    {
      "title": "Real-World Usage",
      "content": "This is used in color transformations, sound encoding, robotics, and AI. Coordinate systems let us shift perspective, compress data, and solve systems efficiently."
    },
    {
      "title": "Recap",
      "content": "We explored what coordinate systems are, how they work with bases, how to convert between them, and why this concept powers nearly every applied system in engineering and computer science."
    }
  ]
}