{
    "title": "Browser Password Harvesting Tools Overview",
    "sections": [
      {
        "title": "Introduction (Wide Shot)",
        "content": "Hello everyone, welcome to this overview of tools used for harvesting passwords from web browsers! I'm Sayed Jihad Al Sayed, and today we'll explore some powerful tools that can extract saved credentials from popular browsers. Let's get started!"
      },
      {
        "title": "Tool 1: LaZagne (Wide Shot)",
        "content": "First on our list is LaZagne, an open-source tool designed to retrieve stored credentials from various applications, including web browsers like Chrome, Firefox, and Edge.",
        "code": "LaZagne.exe all",
        "video_link": "https://www.youtube.com/link_to_lazagne_video",
        "github_repository": "https://github.com/AlessandroZ/LaZagne"
      },
      {
        "title": "Tool 2: BrowserPassView (Wide Shot)",
        "content": "Next up is BrowserPassView, a lightweight tool by NirSoft that allows you to view and export passwords stored by various web browsers.",
        "code": "BrowserPassView.exe",
        "video_link": "https://www.youtube.com/link_to_browserpassview_video",
        "github_repository": "https://www.nirsoft.net/utils/browser_password_view.html"
      },
      {
        "title": "Tool 3: Mimikatz (Extended for Browser Passwords) (Wide Shot)",
        "content": "Mimikatz is widely known for extracting credentials from memory, but with certain extensions or custom scripts, it can also retrieve passwords stored in browsers.",
        "code": "mimikatz.exe",
        "video_link": "https://www.youtube.com/link_to_mimikatz_video",
        "github_repository": "https://github.com/gentilkiwi/mimikatz"
      },
      {
        "title": "Tool 4: SniffPass (Wide Shot)",
        "content": "SniffPass is another tool by NirSoft that captures passwords transmitted over the network through non-encrypted connections. While it doesn't directly harvest stored browser passwords, it can capture them if they are sent in plaintext.",
        "code": "SniffPass.exe",
        "video_link": "https://www.youtube.com/link_to_sniffpass_video",
        "github_repository": "https://www.nirsoft.net/utils/password_sniffer.html"
      },
      {
        "title": "Conclusion (Wide Shot)",
        "content": "That wraps up our overview of tools for harvesting browser passwords. Remember, these tools are powerful and should be used responsibly. If you found this video informative, please like, subscribe, and share your thoughts in the comments. Thanks for watching, and see you in the next video!"
      }
    ]
  }
  